In [19]:
import pandas as pd
df = pd.DataFrame({'Age':[25,30,None,22,28]})
df['Age'].fillna(df['Age'].mean(), inplace=True)
df.isnull()

C:\Users\LabStudent\AppData\Local\Temp\ipykernel_10436\586340304.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)

     Age
0  False
1  False
2  False
3  False
4  False

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     5 non-null      float64
dtypes: float64(1)
memory usage: 172.0 bytes

In [22]:
df = pd.DataFrame({'Salary': [50000,60000,None,55000,52000]})
df

    Salary
0  50000.0
1  60000.0
2      NaN
3  55000.0
4  52000.0

In [25]:
df.info()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Salary  4 non-null      float64
dtypes: float64(1)
memory usage: 172.0 bytes

Salary    1
dtype: int64

In [26]:
df['Salary'].fillna(df['Salary'].median(), inplace = True)

C:\Users\LabStudent\AppData\Local\Temp\ipykernel_10436\3076352609.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].median(), inplace = True)

In [27]:
df

    Salary
0  50000.0
1  60000.0
2  53500.0
3  55000.0
4  52000.0